  "use strict"
   let pass = 1;
   let sum = 0;
   let andzer = 0;
  alert( `Բարի գալուստ "Ով է ուզում դառնալ միլիոնատեր" ինտելեկտուալ խաղ`);
  let main = confirm(`Խաղը կազմված է 11 հարցից։
  *Յուրաքանցհյուր ճիշտ պատասխանի դիմաց Դուք կվաստակեք միավորներ։
  *Հացերին կարող եք պատասխանել ինչպես հայատառ, այնպես էլ latinatar։
  *Հարցերի պատասխանեու a b c d տարբերակը նույնպես ընդունել է։
  *Յուրաքանչյուր փուլից առաջ Դուք ունեք հնարավորություն կանգնեցնել խաղը։
            Դե ի՞նչ։ Պատրա՞ստ էս `)
  if (main == false){
    pass = false};
  
  if(pass)
  {let harc = prompt(`Հարց 1
  Ո՞րն է Ռուսաստանի Դաշնության մայրաքաղաքը։
 
  a)Մինսկ        b) Մոսկվա
  c)Կիև            d)Սանկտ-Պետերբուրգ`);
  if (harc == "Մոսկվա" || harc =="մոսկվա" || harc == "moskva" || harc == "Moskva" || harc =="b"){
    sum = 1000;
    alert(`Շնորհավորոում եմ դուք ճիշտ եք:
 Դուք վաստակեցիք ${sum} միավոր`)
  }
  else{
    alert(`Ո՜չ,դուք սխալվեցիք և ճիշտ պատասխանն է b)"Մոսկվա"։
Ցավոք Ձեր խաղն ավարտվեց։
 Դուք վաստակեցիք՝  ${sum} միավոր։` );
 pass = false
  }
};

  if(pass){
    let main = confirm(`Հարց 2      Քո ընթացիք միավորն է  ${sum}
  
    Նշվածներից ո՞ր ֆիլմն է նկարահանվել Գյուրիում։
 
    a)"Մենք ենք մեր սարերը"          b)"Երջանկության մեխանիկա"
  c)"Մեր մանկության տանգոն"     d)"Ռեմբո 2"`);
    
    if (main == false){
      alert(`Շնորհավոր:
      Դուք վաստակեցիք ${sum} միավոր`),
      pass = false
    }};
    if(pass){
    let harc= prompt(`
  Նշվածներից ո՞ր ֆիլմն է նկարահանվել Գյուրիում։
  
  a)"Մենք ենք մեր սարերը"          b)"Երջանկության մեխանիկա"
  c)"Մեր մանկության տանգոն"     d)"Ռեմբո 2"`)
  if (harc == "c" || harc == "mer mankutyan tangon"  || harc == "Մեր մանկության տանգոն"
     || harc == "մեր մանկության տանգոն" )
      {sum += sum,
      alert(`Շնորհավորոում եմ դուք ճիշտ եք:
 Դուք վաստակեցիք ${sum} միավոր`)}
 else {
  alert(`Ո՜չ,դուք սխալվեցիք և ճիշտ պատասխանն է c)"Մեր մանկության տանգոն"։
  Ցավոք Ձեր խաղն ավարտվեց։
  Դուք վաստակեցիք՝  ${sum-sum} միավոր։`),
   pass = false
 }};
  
  if(pass){  
    let main = confirm(`Հարց 3     Քո ընթացիք միավորն է  ${sum}
  
    Նշվածներից ո՞րի հեղինակը չէ՜ Հ.Թումանյանը։
  
    a)"Գիքոր"                    b)"Աբու Լալա Մահարի"
  c)"Թմբկաբերդի առումը"         d)"Շունն ու կատուն"`);
    if (main == false){
      alert(`Շնորհավոր:
      Դուք վաստակեցիք ${sum} միավոր`);
      pass = false
    }}
    if(pass){
  let harc =  prompt(`
  Նշվածներից ո՞րի հեղինակը չէ՜ Հ.Թումանյանը։
 
  a)"Գիքոր"                        b)"Աբու Լալա Մահարի"
  c)"Թմբկաբերդի առումը"         d)"Շունն ու կատուն"`)
  if (harc == "b" || harc == "Աբու Լալա Մահարի" ||  harc == "աբու լալա մահարի" || harc == "abu lala mahari" || harc == "Abu lala mahari")
  {sum += sum,
    alert(`Շնորհավորոում եմ դուք ճիշտ եք:
Դուք վաստակեցիք ${sum} միավոր`)}
else {
alert(`Ո՜չ,դուք սխալվեցիք և ճիշտ պատասխանն է b)"Աբու Լալա Մահարի"։
Ցավոք Ձեր խաղն ավարտվեց։
Դուք վաստակեցիք՝  ${sum-sum} միավոր։`),
pass = false
}
}
if(pass)
{
  let main = confirm(`Հարց 4      Քո ընթացիք միավորն է  ${sum}

  Ե՞րբ է հռչակվել Հայաստանի առաջին հանրապետությունը։

  a)1920թ Նոյեմբերի 7-ին     b)1991թ սեպտեմբերի 21-ին
c)Մ.Թ.Ա 3րդ դար                d)1918թ Մայիսի 28-ին`);
if (main == false){
  alert(`Շնորհավոր:
  Դուք վաստակեցիք ${sum} միավոր`),
  pass = false}}
  if(pass){
  let harc =  prompt(`
  Ե՞րբ է հռչակվել Հայաստանի առաջին հանրապետությունը։
 
  a)1920թ Նոյեմբերի 7-ին     b)1991թ սեպտեմբերի 21-ին
  c)Մ.Թ.Ա 3րդ դար                d)1918թ Մայիսի 28-ին`)
  if (harc == "d" || harc == "1918թ Մայիսի 28-ին" ||  harc == "1918" || harc == "1918թ")
  {sum += sum,
    alert(`Շնորհավորոում եմ դուք ճիշտ եք:
Դուք վաստակեցիք ${sum} միավոր`)}
else {
alert(`Ո՜չ,դուք սխալվեցիք և ճիշտ պատասխանն է d)1918թ Մայիսի 28-ին։
Ցավոք Ձեր խաղն ավարտվեց։
Դուք վաստակեցիք՝  ${sum-sum} միավոր։`);
 pass = false
}}
if(pass)
{  
  let main = confirm(`Հարց 5       Քո ընթացիք միավորն է  ${sum}

  Նշված կենդանիներից ո՞րն ունի ամենաերկար լեզուն։

  a)Արջ              b)Վագր
c)Ընձուղտ       d)Աքլոր`);
if (main == false){
  alert(`Շնորհավոր:
  Դուք վաստակեցիք ${sum} միավոր`),
  pass = false}}
  if(pass)
 { let harc =  prompt(`
  Նշված կենդանիներից ո՞րն ունի ամենաերկար լեզուն։
 
  a)Արջ              b)Վագր
  c)Ընձուղտ       d)Աքլոր`)
  if (harc == "c" || harc == "ընձուղտ" ||  harc == "Ընձուղտ" || harc == "@ndzuxt")
  {sum += sum,
    alert(`Շնորհավորոում եմ դուք ճիշտ եք:
Դուք վաստակեցիք ${sum} միավոր:`)}
else {
alert(`Ո՜չ,դուք սխալվեցիք և ճիշտ պատասխանն է  c)Ընձուղտ։
Ցավոք Ձեր խաղն ավարտվեց։
Դուք վաստակեցիք՝  ${sum-sum} միավոր։`);
 pass = false
}}
if(pass)
{ 
  let main = confirm(`Հարց 6        Քո ընթացիք միավորն է  ${sum}

  Ի՞նչ անունով է ավեի շատ հայտնի «Պոլիգրաֆ» կոչվող սարքը։

  a)Քսերոքս      b)Ստի դետեկոր
c)Ռադար        d)Գծագրական գործիք`);
if (main == false){
  alert(`Շնորհավոր:
   Դուք վաստակեցիք ${sum} միավոր`),
  pass = false}}
  if(pass)
  {let harc =  prompt(`
  Ի՞նչ անունով է ավեի շատ հայտնի «Պոլիգրաֆ» կոչվող սարքը։
 
  a)Քսերոքս      b)Ստի դետեկոր
  c)Ռադար        d)Գծագրական գործիք`)
  if (harc == "b" || harc == "Ստի դետեկոր" ||  harc == "ստի դետեկոր" || harc == "sti detektor")
  {sum += sum,
    alert(`Շնորհավորոում եմ դուք ճիշտ եք:
Դուք վաստակեցիք ${sum} միավոր:
 Դու ունես արդեն անձեռնամխելի գումար,որը չես կարող կորցնել։`)}
else {
alert(`Ո՜չ,դուք սխալվեցիք և ճիշտ պատասխանն է  b)Ստի դետեկոր։
Ցավոք Ձեր խաղն ավարտվեց։
Դուք վաստակեցիք՝  ${sum-sum} միավոր։`),
 pass = false
}};
if(pass)
{ 
  let main = confirm(`Հարց 7        Քո ընթացիք միավորն է  ${sum}

  Նշվածներից ո՞րը ծրագրավորման լեզու չէ։

  a)PHP      b)Java Script
  c)CSS      d)C#`);
if (main == false){
  alert(`Շնորհավոր:
   Դուք վաստակեցիք ${sum} միավոր`);
  pass = false}};
  if(pass)
 { let harc =  prompt(`
  Նշվածներից ո՞րը ծրագրավորման լեզու չէ։

  a)PHP      b)Java Script
  c)CSS      d)C#`)
  if (harc == "c" || harc == "CSS" ||  harc == "css")
  {sum += sum,
    alert(`Շնորհավորոում եմ դուք ճիշտ եք:
Դուք վաստակեցիք ${sum} միավոր:`)}
else {
alert(`Ո՜չ,դուք սխալվեցիք և ճիշտ պատասխանն է  c)CSS ։
Ցավոք Ձեր խաղն ավարտվեց։
Դուք վաստակեցիք՝  ${sum} միավոր։`);
 pass = false
}};
if(pass)
{ 
  let main = confirm(`Հարց 8        Քո ընթացիք միավորն է  ${sum}

  Ո՞ր հանքանյութի անունն է ծագել հունարեն "գրում եմ" բառից։

  a)Ասբեստ      b)Ագաթ
  c)Գրաֆիտ      d)նռնաքար`);
if (main == false){
  alert(`Շնորհավոր:
   Դուք վաստակեցիք ${sum} միավոր`);
  pass = false}};
  if(pass)
 { let harc =  prompt(`
  Ո՞ր հանքանյութի անունն է ծագել հունարեն "գրում եմ" բառից։

  a)Ասբեստ      b)Ագաթ
  c)Գրաֆիտ      d)նռնաքար`)
  if (harc == "c" || harc == "Grafit" ||  harc == "grafit" || harc =="Գրաֆիտ" || harc =="գրաֆիտ")
  {sum += sum - 3000,
    alert(`Շնորհավորոում եմ դուք ճիշտ եք:
Դուք վաստակեցիք ${sum} միավոր։`)}
else {
alert(`Ո՜չ,դուք սխալվեցիք և ճիշտ պատասխանն է  c)Գրիֆիտ։
Ցավոք Ձեր խաղն ավարտվեց։
Դուք վաստակեցիք՝  ${sum / 2} միավոր։`),
 pass= false
}};
if(pass)
{ 
  andzer = 32000;
  let main = confirm(`Հարց 9        Քո ընթացիք միավորն է  ${sum}

  Ո՞ր երկիրն է կոչվում «հազար լճերի երկիր»։

  a)Շվեդիա        b)Ֆինլանդիա
  c)Նորվեգիա      d)Իսլանդիա`);
if (main == false){
  alert(`Շնորհավոր:
   Դուք վաստակեցիք ${sum} միավոր`),
  pass= false}};
  if(pass)
  {let harc =  prompt(`
  Ո՞ր երկիրն է կոչվում «հազար լճերի երկիր»։

  a)Շվեդիա        b)Ֆինլանդիա
  c)Նորվեգիա      d)Իսլանդիա`)
  if (harc == "b" || harc == "ֆինլանդիա" ||  harc == "Ֆինլանդիա" || harc =="Finlandia" || harc =="finlandia")
  {sum += sum ,
    alert(`Շնորհավորոում եմ դուք ճիշտ եք:
Դուք վաստակեցիք ${sum} միավոր:
 Դու ունես արդեն ${sum} անձեռնամխելի միավոր,որը չես կարող կորցնել։`)}
else {
alert(`Ո՜չ,դուք սխալվեցիք և ճիշտ պատասխանն է  b)Ֆինլանդիա։
Ցավոք Ձեր խաղն ավարտվեց։
Դուք վաստակեցիք՝  ${andzer} միավոր։`),
 pass = false
}};
if(pass)
{ 
   andzer = sum;
  let main = confirm(`Հարց 10       Քո ընթացիք միավորն է  ${sum}

  Այս գրողներից ո՞վ է մասնակցել առաջին համաշխարհային պատերազմին։

  a)Լև Տոլստոյ        b)Մարկ Տվեն
  c)Էռնեստ Հեմիգուեյ  d)Չարլզ Դիքենս`);
if (main == false){
  alert(`Շնորհավոր:
   Դուք վաստակեցիք ${sum} միավոր`),
  pass = false}};
  if(pass)
  {let harc =  prompt(`
  Այս գրողներից ո՞վ է մասնակցել առաջին համաշխարհային պատերազմին։

  a)Լև Տոլստոյ        b)Մարկ Տվեն
  c)Էռնեստ Հեմիգուեյ  d)Չարլզ Դիքենս`)
  if (harc == "c" || harc == "Էռնեստ Հեմիգուեյ" ||  harc == "էռնեստ Հեմիգուեյ" || harc =="Ernest Heminguey" || harc =="ernest heminguey")
  {sum += sum ,
    alert(`Շնորհավորոում եմ դուք ճիշտ եք:
Դուք վաստակեցիք ${sum} միավոր:`)}
else {
alert(`Ո՜չ,դուք սխալվեցիք և ճիշտ պատասխանն է  c)Էռնեստ Հեմիգուեյ։
Ցավոք Ձեր խաղն ավարտվեց։
Դուք վաստակեցիք  ${andzer} միավոր։`);
 pass = false
}};
if(pass)
{ 
  let main = confirm(`Հարց 11       Քո ընթացիք միավորն է  ${sum}

  Իտալերենից թարգմանաբար «վերմիշել» նշանակում է...։

  a)Ծղոտներ        b)Թելեր
  c)Լարեր           d)Որդեր`);
if (main == false){
  alert(`Շնորհավոր:
   Դուք վաստակեցիք ${sum} միավոր`);
  pass = false}};
  if(pass)
  {let harc =  prompt(`
  Իտալերենից թարգմանաբար «վերմիշել» նշանակում է...։

  a)Ծղոտներ        b)Թելեր
  c)Լարեր           d)Որդեր`)
  if (harc == "d" || harc == "Որդեր" ||  harc == "որդեր" || harc =="vorder" || harc =="Vorder")
  {sum += sum ,
    alert(`Շնորհավորոում եմ դուք ճիշտ եք:
Դուք վաստակեցիք ${sum} միավոր:`)}
else {
alert(`Ո՜չ,դուք սխալվեցիք և ճիշտ պատասխանն է  c)Էռնեստ Հեմիգուեյ։
Ցավոք Ձեր խաղն ավարտվեց։
Դուք վաստակեցիք  ${andzer} միավոր։`);
 pass = false
}}

